Repository: josuebaez61/dotnet-api-seed
Catalog: src/CleanArchitecture.API/Resources/Messages.*.resx
Languages: es

# SUCCESS_ROLE_DELETED
source: Role deleted successfully
es: Rol eliminado exitosamente

# SUCCESS_EMAIL_VERIFIED
source: Email change verification successful
es: Verificación de cambio de correo exitosa

# SUCCESS_USER_CREATED
source: User created successfully
es: Usuario creado exitosamente

# SUCCESS_USER_UPDATED
source: User updated successfully
es: Usuario actualizado exitosamente

# SUCCESS_USER_DELETED
source: User deleted successfully
es: Usuario eliminado exitosamente

# SUCCESS_LOGIN_SUCCESSFUL
source: Login successful
es: Inicio de sesión exitoso

# SUCCESS_LOGOUT_SUCCESSFUL
source: Logout successful
es: Cierre de sesión exitoso

# SUCCESS_PASSWORD_CHANGED
source: Password changed successfully
es: Contraseña cambiada exitosamente

# SUCCESS_PASSWORD_RESET_CODE_SENT
source: Password reset code sent
es: Código de restablecimiento de contraseña enviado

# SUCCESS_PASSWORD_RESET_SUCCESSFUL
source: Password reset successfully
es: Contraseña restablecida exitosamente

# SUCCESS_EMAIL_SENT
source: Email sent successfully
es: Correo enviado exitosamente

# SUCCESS_EMAIL_CHANGE_VERIFICATION_SENT
source: Email change verification sent
es: Verificación de cambio de correo enviada

# SUCCESS_EMAIL_CHANGED
source: Email changed successfully
es: Correo cambiado exitosamente

# SUCCESS_TOKEN_REFRESHED
source: Token refreshed successfully
es: Token actualizado exitosamente

# SUCCESS_TEST_EMAIL_SENT
source: Test {0} email sent successfully
es: Correo de prueba {0} enviado exitosamente

# SUCCESS_USERS_RETRIEVED
source: Users retrieved successfully
es: Usuarios obtenidos exitosamente

# SUCCESS_ROLE_PERMISSIONS_UPDATED
source: Role permissions updated successfully
es: Permisos del rol actualizados exitosamente

# SUCCESS_USER_ROLES_UPDATED
source: User roles updated successfully
es: Roles del usuario actualizados exitosamente

# SUCCESS_ROLE_ASSIGNED_TO_USER
source: Role assigned to user successfully
es: Rol asignado al usuario exitosamente

# ERROR_INVALID_TEST_EMAIL_TYPE
source: Invalid email type
es: Tipo de correo inválido

# ERROR_EMAIL_VERIFICATION_CODE_EXPIRED
source: Email verification code has expired
es: El código de verificación de correo ha expirado

# ERROR_USER_NOT_FOUND
source: User not found
es: Usuario no encontrado

# ERROR_INVALID_CREDENTIALS
source: Invalid credentials
es: Email/nombre de usuario o contraseña inválidos

# ERROR_ACCOUNT_DEACTIVATED
source: Account is deactivated
es: La cuenta está desactivada

# ERROR_USER_ALREADY_EXISTS
source: User already exists
es: El usuario ya existe

# ERROR_INVALID_PASSWORD
source: Invalid password
es: Contraseña inválida

# ERROR_INVALID_REFRESH_TOKEN
source: Session expired. Please log in again.
es: Token de actualización inválido

# ERROR_PASSWORD_RESET_CODE_INVALID
source: Invalid password reset code
es: Código de restablecimiento de contraseña inválido

# ERROR_PASSWORD_RESET_CODE_EXPIRED
source: Password reset code has expired
es: El código de restablecimiento de contraseña ha expirado

# ERROR_PASSWORD_RESET_CODE_ALREADY_USED
source: Password reset code has already been used
es: El código de restablecimiento de contraseña ya ha sido utilizado

# ERROR_CURRENT_PASSWORD_INCORRECT
source: Current password is incorrect
es: La contraseña actual es incorrecta

# ERROR_PASSWORD_CHANGE_FAILED
source: Failed to change password
es: Error al cambiar la contraseña

# ERROR_PASSWORD_CHANGE_NOT_REQUIRED
source: User does not need to change password
es: El usuario no necesita cambiar la contraseña

# ERROR_INSUFFICIENT_PERMISSIONS
source: Insufficient permissions. Required: {0}
es: Permisos insuficientes. Requerido: {0}

# ERROR_ROLE_NOT_FOUND
source: Role not found: {0}
es: Rol no encontrado: {0}

# ERROR_ROLE_NOT_FOUND_BY_ID
source: Role not found with ID: {0}
es: Rol no encontrado con ID: {0}

# ERROR_ROLE_ALREADY_EXISTS
source: Role already exists: {0}
es: El rol ya existe: {0}

# ERROR_PERMISSION_NOT_FOUND
source: Permission not found: {0}
es: Permiso no encontrado: {0}

# ERROR_PERMISSION_NOT_FOUND_BY_ID
source: Permission not found with ID: {0}
es: Permiso no encontrado con ID: {0}

# ERROR_PERMISSION_ALREADY_EXISTS
source: Permission already exists: {0}
es: El permiso ya existe: {0}

# ERROR_USER_NOT_IN_ROLE
source: User {0} is not in role {1}
es: El usuario {0} no está en el rol {1}

# ERROR_ROLE_PERMISSION_NOT_FOUND
source: Role {0} does not have permission {1}
es: El rol {0} no tiene el permiso {1}

# ERROR_INVALID_TOKEN
source: Invalid or expired token
es: Token inválido o expirado

# ERROR_EMAIL_NOT_CONFIRMED
source: Email not confirmed
es: Correo no confirmado

# ERROR_VALIDATION_FAILED
source: Validation failed
es: Error de validación

# ERROR_UNAUTHORIZED
source: Unauthorized
es: No autorizado

# ERROR_FORBIDDEN
source: Access denied
es: Acceso denegado

# ERROR_INTERNAL_SERVER_ERROR
source: Internal server error
es: Error interno del servidor

# ERROR_DATABASE_ERROR
source: Database error
es: Error de base de datos

# ERROR_EMAIL_SENDING_FAILED
source: Failed to send email
es: Error al enviar el correo

# ERROR_TEST_EMAIL_FAILED
source: Failed to send test email: {0}
es: Error al enviar correo de prueba: {0}

# ERROR_EMAIL_ALREADY_EXISTS
source: Email already exists
es: El correo ya existe

# ERROR_EMAIL_CHANGE_VERIFICATION_CODE_INVALID
source: Invalid email change verification code
es: Código de verificación de cambio de correo inválido

# ERROR_EMAIL_CHANGE_VERIFICATION_CODE_EXPIRED
source: Email change verification code has expired
es: El código de verificación de cambio de correo ha expirado

# ERROR_EMAIL_CHANGE_VERIFICATION_CODE_ALREADY_USED
source: Email change verification code has already been used
es: El código de verificación de cambio de correo ya ha sido utilizado

# ERROR_INVALID_OPERATION
source: Invalid operation
es: Operación inválida

# ERROR_EMAIL_CANNOT_BE_THE_SAME_AS_CURRENT
source: The new email '{0}' cannot be the same as the current email.
es: El nuevo correo '{0}' no puede ser el mismo que el actual.

# ERROR_MUST_CHANGE_PASSWORD
source: You must change your password before continuing
es: Debes cambiar tu contraseña antes de continuar

# VALIDATION_REQUIRED_FIELD
source: The field '{0}' is required
es: El campo '{0}' es requerido

# VALIDATION_INVALID_EMAIL_FORMAT
source: Invalid email format
es: Formato de correo inválido

# VALIDATION_PASSWORD_TOO_WEAK
source: Password does not meet security requirements
es: La contraseña no cumple con los requisitos de seguridad

# VALIDATION_INVALID_DATE_OF_BIRTH
source: Invalid date of birth
es: Fecha de nacimiento inválida

# VALIDATION_INVALID_AGE
source: Invalid age. Must be between 13 and 120 years old
es: Edad inválida. Debe estar entre 13 y 120 años

# VALIDATION_USERNAME_TOO_SHORT
source: Username must be at least {0} characters long
es: El nombre de usuario debe tener al menos {0} caracteres

# VALIDATION_USERNAME_TOO_LONG
source: Username must be at most {0} characters long
es: El nombre de usuario debe tener como máximo {0} caracteres

# VALIDATION_INVALID_USERNAME_FORMAT
source: Invalid username format. Only letters, numbers, and underscores are allowed
es: Formato de nombre de usuario inválido. Solo se permiten letras, números y guiones bajos

# VALIDATION_INVALID_PAGINATION_PARAMETERS
source: Invalid pagination parameters
es: Parámetros de paginación inválidos

# EMAIL_EMAIL_CHANGE_VERIFICATION_SUBJECT
source: Verify Your Email Change
es: Verifica tu Cambio de Correo

# EMAIL_EMAIL_CHANGE_CONFIRMATION_SUBJECT
source: Email Successfully Changed
es: Correo Cambiado Exitosamente

# EMAIL_PASSWORD_RESET_SUBJECT
source: Password Reset Code
es: Código de Restablecimiento de Contraseña

# EMAIL_WELCOME_SUBJECT
source: Welcome to Clean Architecture
es: Bienvenido a Clean Architecture

# EMAIL_PASSWORD_CHANGED_SUBJECT
source: Password Changed Successfully
es: Contraseña Cambiada Exitosamente

# TEMPORARY_PASSWORD_SUBJECT
source: Account Created - Temporary Password
es: Cuenta Creada - Contraseña Temporal

# SUBJECT_PASSWORD_RESET
source: Password Reset Code
es: Código de Restablecimiento de Contraseña

# SUBJECT_EMAIL_CHANGE_VERIFICATION
source: Verify Your Email Change
es: Verifica tu Cambio de Correo

# SUBJECT_EMAIL_CHANGE_CONFIRMATION
source: Email Successfully Changed
es: Correo Cambiado Exitosamente

# SUBJECT_WELCOME
source: Welcome to Clean Architecture
es: Bienvenido a Clean Architecture

# SUBJECT_PASSWORD_CHANGED
source: Password Changed Successfully
es: Contraseña Cambiada Exitosamente

# SUBJECT_TEMPORARY_PASSWORD
source: Account Created - Temporary Password
es: Cuenta Creada - Contraseña Temporal

# USER_PERMISSIONS_RETRIEVED
source: User permissions retrieved successfully
es: Permisos del usuario obtenidos exitosamente
